# **‚ÄúMovie Night Planner‚Äù üåÉ**

> A system to help users plan movie nights with friends, store favorite movies, ratings, users, and who watched what.

## üîß Phase 1 ‚Äì Build the Database in MySQL Workbench

* create a database for a small app that stores users, movies, genres, and watch history.

`Database Name: movie_night`

### Tables to Create



```
-- Table 1: Users
CREATE TABLE users (
  user_id INT PRIMARY KEY AUTO_INCREMENT,
  username VARCHAR(100),
  email VARCHAR(100),
  age INT
);

-- Table 2: Movies
CREATE TABLE movies (
  movie_id INT PRIMARY KEY AUTO_INCREMENT,
  title VARCHAR(150),
  release_year INT,
  genre_id INT
);

-- Table 3: Genres
CREATE TABLE genres (
  genre_id INT PRIMARY KEY AUTO_INCREMENT,
  genre_name VARCHAR(50)
);

-- Table 4: Watch History
CREATE TABLE watch_history (
  watch_id INT PRIMARY KEY AUTO_INCREMENT,
  user_id INT,
  movie_id INT,
  rating FLOAT,
  watch_date DATE,
  FOREIGN KEY (user_id) REFERENCES users(user_id),
  FOREIGN KEY (movie_id) REFERENCES movies(movie_id)
);

```

### Sample Data



```
INSERT INTO genres (genre_name) VALUES ('Action'), ('Comedy'), ('Sci-Fi');

INSERT INTO movies (title, release_year, genre_id) VALUES
('Inception', 2010, 3),
('The Hangover', 2009, 2),
('John Wick', 2014, 1);

INSERT INTO users (username, email, age) VALUES
('alex', 'alex@gmail.com', 24),
('lina', 'lina@yahoo.com', 22);

INSERT INTO watch_history (user_id, movie_id, rating, watch_date) VALUES
(1, 1, 9.5, '2024-12-01'),
(2, 2, 8.0, '2024-12-02');

```

## üêç Phase 2 ‚Äì Connect to MySQL from Python

**Tools**
 * Python 3
 * `mysql-connector-python` OR `SQLAlchemy`
 * VS Code or Jupyter Notebook

### Imports

In [2]:
import pandas as pd
from sqlalchemy import create_engine, text
from urllib.parse import quote_plus
from sqlalchemy.orm import sessionmaker

In [3]:
password = quote_plus("MySql@2024!")
engine = create_engine(f"mysql+pymysql://root:{password}@localhost:3306/movie_night")

## üí° Phase 3 ‚Äì 10 SQL Tasks to Run from Python
**We‚Äôve prepared 15 hands-on tasks grouped by difficulty**

### üü¢ Easy Level Tasks (Basics ‚Äì SELECT, INSERT, LIKE)
| Task # | Task Description                                       |
|--------|--------------------------------------------------------|
| 1      | Show all users                                         |
| 2      | Show all movies with title and release year            |
| 3      | Add a new movie using Python input                     |
| 4      | Search for a movie by partial title (LIKE)             |
| 5      | Show all users under the age of 25                     |

**Task 1: Show all users**

In [8]:
tables = ['users', 'movies', 'genres', 'watch_history']
for table in tables:
    print(f"==={table}===")
    df = pd.read_sql(f"""
                     SELECT * FROM {table}
        """, engine)
    display(df)

===users===

   user_id username            email  age
0        1     alex   alex@gmail.com   24
1        2     lina   lina@yahoo.com   22
2        4    ahmed  ahmed@gmail.com   27

===movies===

   movie_id         title  release_year  genre_id
0         1     Inception          2010         3
1         2  The Hangover          2009         2
2         3     John Wick          2014         1
3         4  The Departed          2006         1

===genres===

   genre_id genre_name
0         1     Action
1         2     Comedy
2         3     Sci-Fi

===watch_history===

   watch_id  user_id  movie_id  rating  watch_date
0         1        1         1     9.5  2024-12-01
1         2        2         2     8.0  2024-12-02
2         6        4         1     NaN  2024-05-01

**Task 2: Show all movies with title and release year**

In [36]:
df = pd.read_sql("""
                 SELECT title, release_year
                 FROM movies
    """, engine)
display(df)

          title  release_year
0     Inception          2010
1  The Hangover          2009
2     John Wick          2014

**Task 3: Add a new movie using Python input**

In [40]:
Session = sessionmaker(bind=engine)
session = Session()

conn = session.connection()
cursor = conn.connection.cursor()

In [39]:
movie = input("Enter the movie's name: ")
year = int(input("Enter the release year: "))
genre_id = int(input("Choose the Genre: 1-Action 2-Comedy 3-Sci-Fi"))
with engine.connect() as conn:
        query = text("""
                INSERT INTO movies (title, release_year, genre_id)
                VALUES (:movie, :release_year, :genre_id)
        """)
        conn.execute(query, {
                "movie": movie,
                "release_year": year,
                "genre_id": genre_id
                })
        conn.commit()

In [41]:
result = cursor.execute("""
        SELECT * FROM movies
        """)
result = cursor.fetchall()
for row in result:
    print(row)

(1, 'Inception', 2010, 3)
(2, 'The Hangover', 2009, 2)
(3, 'John Wick', 2014, 1)
(4, 'The Departed', 2006, 1)
(9, 'The Avengers', 2012, 1)
(10, 'Rush', 2013, 1)

**Task 4: Search for a movie by partial title (LIKE)**

In [41]:
df = pd.read_sql("""
    SELECT title, genre_name 
                FROM movies m
                JOIN genres g
                ON m.genre_id = g.genre_id
                WHERE title LIKE '%%ed'
              """, engine)
display(df)

          title genre_name
0  The Departed     Action

**Task 5: Show all users under the age of 25**<br/>
- ***No users with age more than 25***

In [63]:
df = pd.read_sql("""
    SELECT * FROM users AS users_older_than_25
    WHERE age > 25
    """, engine)
display(df)

   user_id username            email  age
0        4    ahmed  ahmed@gmail.com   27

### üü° Intermediate Level Tasks (JOINs, GROUP BY, Aggregations)
| Task # | Task Description                                                |
|--------|-----------------------------------------------------------------|
| 6      | Show all movies with their genre name (JOIN `movies` and `genres`) |
| 7      | Show all movies watched by user "Alex" (JOIN with `watch_history`) |
| 8      | Count how many users watched each movie (`GROUP BY movie_id`)     |
| 9      | Show average rating for each movie                              |
| 10     | Show users who rated any movie above 9                          |

**Task 6: Show all movies with their genre name (JOIN `movies` and `genres`)**

In [48]:
df = pd.read_sql("""
    SELECT m.title, g.genre_name
    FROM movies m 
    JOIN genres g
    ON m.genre_id = g.genre_id""", engine)
display(df)

          title genre_name
0     Inception     Sci-Fi
1  The Hangover     Comedy
2     John Wick     Action
3  The Departed     Action

**Task 7: Show all movies watched by user "Alex" (JOIN with `watch_history`)**

In [51]:
df = pd.read_sql("""
    SELECT U.username, M.title, H.rating, H.watch_date
    FROM users U
    JOIN watch_history H
    ON U.user_id = H.user_id
    JOIN movies M
    ON M.movie_id = H.movie_id
    WHERE username = 'Alex'
    """, engine)
display(df)

  username      title  rating  watch_date
0     alex  Inception     9.5  2024-12-01

**Task 8: Count how many users watched each movie (`GROUP BY movie_id`)**

In [6]:
cursor.execute("""
    INSERT INTO watch_history (user_id, movie_id, watch_date)
            VALUES
            (4, 1, '2024-05-01')
            """)
conn.commit()

In [7]:
df = pd.read_sql("""
    SELECT  M.title, COUNT(H.movie_id) AS No_of_users_watched
            FROM movies M
            JOIN watch_history H
            ON M.movie_id = h.movie_id
            GROUP BY(H.movie_id)""", engine)
display(df)

          title  No_of_users_watched
0     Inception                    2
1  The Hangover                    1

**Task 9: Show average rating for each movie**

In [43]:
df = pd.read_sql("""
    SELECT  M.title, AVG(H.rating)
        FROM movies M
        JOIN watch_history H
        ON M.movie_id = H.movie_id
        GROUP BY(M.title)""", engine)
display(df)

          title  AVG(H.rating)
0     Inception            9.0
1  The Hangover            8.0

**Task 10: Show users who rated any movie above 9**

In [4]:
df = pd.read_sql("""
    SELECT U.username, M.title, H.rating
    FROM users U
    JOIN watch_history H
    ON U.user_id = H.user_id
    JOIN movies M
    ON M.movie_id = H.movie_id
    WHERE H.rating > 9
    """, engine)
display(df)

  username      title  rating
0     alex  Inception     9.5

### üî¥ Advanced Level Tasks (Nested Queries, Filtering, Conditions)
| Task # | Task Description                                                                 |
|--------|----------------------------------------------------------------------------------|
| 11     | Show top 3 highest-rated movies (use `ORDER BY` and `LIMIT`)                     |
| 12     | Show movies that have **never** been watched (LEFT JOIN + `IS NULL`)             |
| 13     | Show the movie with the highest **average rating** (nested query)                |
| 14     | Show the number of movies watched by each user (GROUP BY + COUNT)                |
| 15     | List users who have watched **more than one** movie (HAVING COUNT > 1)           |

**Task 11: Show top 3 highest-rated movies (use `ORDER BY` and `LIMIT`)**

In [8]:
df = pd.read_sql("""
    SELECT M.title, AVG(H.rating) AS average_rating
    FROM movies M
    JOIN watch_history H
    ON M.movie_id = H.movie_id
    GROUP BY M.title
    ORDER BY average_rating DESC
    LIMIT 3""", engine)
display(df)

          title  average_rating
0          Rush             9.2
1     Inception             9.0
2  The Hangover             8.0

**Task 12: Show movies that have **never** been watched (LEFT JOIN + `IS NULL`)**

In [16]:
df = pd.read_sql("""
    SELECT M.title
    FROM movies M
    LEFT JOIN watch_history H
    ON M.movie_id = H.movie_id
    WHERE watch_date IS NULL
    """, engine)
display(df)

          title
0     John Wick
1  The Departed

**Task 13: Show the movie with the highest **average rating** (nested query)**<br/>
* **SOLVE AGAIN BY YOURSELF!!!!**

In [54]:
df = pd.read_sql("""
    SELECT *
    FROM movies
    WHERE movie_id IN (
        SELECT movie_id
        FROM watch_history
        GROUP BY movie_id
        HAVING AVG(rating) = (
            SELECT MAX(avg_rating)
            FROM (
                SELECT movie_id, AVG(rating) as avg_rating
                FROM watch_history
                GROUP BY movie_id
        ) subquery
    )
)

                 """, engine)
display(df)

   movie_id title  release_year  genre_id
0        10  Rush          2013         1

**Task 14: Show the number of movies watched by each user (GROUP BY + COUNT)**

In [39]:
df = pd.read_sql("""
                SELECT U.username, COUNT(H.movie_id) No_of_movies_watched
                FROM users U
                JOIN watch_history H
                ON U.user_id = H.user_id
                GROUP BY H.user_id""", engine)
display(df)

  username  No_of_movies_watched
0     alex                     1
1     lina                     1
2    ahmed                     3

**Task 15: List users who have watched **more than one** movie (HAVING COUNT > 1)**<br/>
* **SOLVE AGAIN BY YOURSELF!!!!**

In [53]:
df = pd.read_sql("""
                SELECT U.*, H.*
                FROM users U
                JOIN watch_history H
                ON U.user_id = H.user_id
                WHERE U.user_id IN (
                    SELECT H.user_id
                    FROM watch_history H
                    GROUP BY H.user_id
                    HAVING COUNT(H.movie_id) > 1
                )""", engine)
display(df)

,user_id,username,email,age,watch_id,user_id,movie_id,rating,watch_date
0,4,ahmed,ahmed@gmail.com,27,6,4,1,8.5,2024-05-01
1,4,ahmed,ahmed@gmail.com,27,7,4,10,9.2,2024-05-21
2,4,ahmed,ahmed@gmail.com,27,8,4,9,7.5,2024-05-14

## üß™ Phase 4 ‚Äì Mini Python App: Movie Night Manager

**Requirements**
 * Take user input to add a new user
 * Let the user search for movies
 * Let them rate and add a movie to their watch history
 * Display all their watched movies and ratings

**Extra Ideas (Optional)**
 * Export Ratings to CSV (using pandas)
 * Basic Terminal Menu App
 * Personal Watchlist Feature